{
    "analysis_id": "5e1e0e0d-cfa1-4ee0-970e-01aa3892f277",
    "filename": "537dfb63-a0b0-4ae4-8cf9-9d1f0820d86e_XIAOMI REDMI 11 .pcapng",
    "analysis_timestamp": "2026-01-22T14:12:19.732049",
    "total_packets": 41,
    "wlan_packets": 41,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "70:a7:41:6b:a9:3d",
            "oui": "70:a7:41",
            "vendor": "Xiaomi",
            "device_model": "XIAOMI REDMI 11",
            "device_category": "mobile_device",
            "is_virtual": false,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 31,
    "btm_responses": 0,
    "btm_success_rate": 0.0,
    "successful_transitions": 0,
    "failed_transitions": 31,
    "loops_detected": false,
    "kvr_support": {
        "k_support": false,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.3333333333333333
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe demostrar soporte activo de BSS Transition Management",
            "category": "btm",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Requests: 31, Responses: 0",
            "recommendation": "El cliente ignora las solicitudes BTM. Se recomienda revisar su política de roaming."
        },
        {
            "check_name": "Movilidad y Handshake",
            "description": "Seguimiento de procesos de enlace y saltos de red",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 0.5,
            "details": "Assoc: 0/0, Reassoc: 0/0",
            "recommendation": "El cliente mantiene conectividad básica pero sin funciones de roaming asistido"
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Cambios de banda: 0",
            "recommendation": "Ajustar umbrales de RSSI para forzar steering"
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": false,
            "severity": "medium",
            "score": 0.3333333333333333,
            "details": "k=False, v=True, r=False",
            "recommendation": "Se recomienda habilitar el estándar faltante para roaming óptimo"
        }
    ],
    "overall_compliance_score": 0.20833333333333331,
    "verdict": "FAILED",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela que no se registraron transiciones exitosas en el proceso de band steering, lo que se traduce en un veredicto de **FALLIDO**. A pesar de que se realizaron 31 intentos de steering, todos resultaron en fallos, y no se detectaron eventos de BTM (BSS Transition Management) que pudieran indicar una gestión activa de la red. La ausencia de BTM Accept (Status Code 0) y la falta de transiciones exitosas confirman que el cliente no logró cambiar de banda, lo que indica un fallo en la implementación del band steering.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\n- **Protocolos Detectados**: No se detectaron eventos de 802.11v, lo que indica que no hubo gestión de transición de BSS. \n- **Intercambio BTM**: No se registraron Requests ni Responses, lo que significa que no hubo intentos de steering efectivo.\n- **Interpretación**: El cliente no mostró comportamiento inteligente en el roaming, ya que no se realizaron intentos de transición a la banda de 5GHz, lo que sugiere que no se está aprovechando la capacidad de la red para optimizar la conexión.\n\n### 3. DETALLE DE TRANSICIONES\nLas transiciones registradas fueron todas fallidas, con un total de 31 intentos de deautenticación (Deauth) que no resultaron en una reasociación exitosa. El tiempo promedio y máximo de transición se reporta como 0s, lo que indica que no hubo tiempo de espera entre los intentos, reforzando la idea de que el cliente no pudo realizar una transición efectiva. No se detectaron bucles entre APs, lo que es un aspecto positivo, pero no compensa la falta de éxito en las transiciones.\n\nEn conclusión, el análisis confirma el veredicto preliminar de **FALLIDO** en la implementación de band steering, evidenciando la necesidad de revisar la configuración de la red y la compatibilidad de los clientes para mejorar la gestión de la transición entre bandas.",
    "fragments": []
}