{
    "analysis_id": "12b32167-4509-464f-ad6a-3d6201003373",
    "filename": "5e50d8c3-a4c1-4e90-9f67-1e0dbaa38298_MOTO G7 .pcapng",
    "analysis_timestamp": "2026-01-22T15:32:28.310306",
    "total_packets": 20,
    "wlan_packets": 20,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "12:27:9e:88:3a:96",
            "oui": "12:27:9e",
            "vendor": "Moto",
            "device_model": "MOTO G7",
            "device_category": "mobile_device",
            "is_virtual": true,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 2,
    "btm_responses": 0,
    "btm_success_rate": 0.0,
    "successful_transitions": 0,
    "failed_transitions": 1,
    "loops_detected": true,
    "kvr_support": {
        "k_support": false,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.3333333333333333
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe demostrar soporte activo de BSS Transition Management",
            "category": "btm",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Requests: 2, Responses: 0",
            "recommendation": "El cliente ignora las solicitudes BTM. Se recomienda revisar su política de roaming."
        },
        {
            "check_name": "Asociación y Reasociación",
            "description": "Verifica ciclos completos de asociación y reasociación",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 0.5,
            "details": "Assoc: 1/1, Reassoc: 3/4",
            "recommendation": "El dispositivo se asocia pero no demuestra cooperación con protocolos inteligentes (BTM)."
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Cambios de banda: 0",
            "recommendation": "Ajustar umbrales de RSSI para forzar steering"
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": false,
            "severity": "medium",
            "score": 0.3333333333333333,
            "details": "k=False, v=True, r=False",
            "recommendation": "Se recomienda habilitar el estándar faltante para roaming óptimo"
        }
    ],
    "overall_compliance_score": 0.20833333333333331,
    "verdict": "FAILED",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela un veredicto preliminar de **FAILED_LOOP**, lo que indica que no hubo transiciones exitosas en el band steering. Se detectaron intentos de steering, pero todos resultaron en fallos. En particular, se observó un bucle en la transición del cliente f8:79:28:56:f3:d5, que intentó cambiar de BSSID pero permaneció en la misma banda (5GHz) durante 78.459 segundos, lo que confirma la falta de éxito en la gestión del band steering. Además, el cliente 60:1d:91:60:fe:f3 experimentó un timeout al intentar cambiar de 2.4GHz a 5GHz, lo que también contribuye al veredicto de fallo. En resumen, no se logró una transición exitosa ni se registraron eventos BTM que pudieran indicar una gestión efectiva del steering.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\nEn la captura analizada, no se detectaron eventos de BSS Transition Management (BTM) ya que el estado fue reportado como NO DETECTADO. Esto indica que no se utilizaron los mecanismos avanzados de steering, como el Probe Suppression. Además, el soporte para los estándares 802.11k, 802.11v y 802.11r fue deficiente, con k=False, v=True y r=False. Esto sugiere que, aunque se intentó utilizar el estándar 802.11v, no se logró una gestión efectiva del roaming, lo que se traduce en un comportamiento de red subóptimo.\n\n### 3. DETALLE DE TRANSICIONES\nSe registraron dos intentos de transición:\n1. **Transición fallida (Agresivo)**: El cliente f8:79:28:56:f3:d5 intentó cambiar de BSSID pero permaneció en la misma banda (5GHz) durante 78.459 segundos, resultando en un bucle. Este intento no fue exitoso y se considera un fallo en la gestión del steering.\n2. **Transición fallida (Asistido)**: El cliente 60:1d:91:60:fe:f3 intentó cambiar de 2.4GHz a 5GHz, pero el intento resultó en un timeout, lo que indica que no se logró la transición deseada.\n\nAmbas transiciones reflejan una falta de efectividad en el band steering, con un tiempo promedio de transición de 64.683 segundos y un tiempo máximo de 78.459 segundos, lo que indica una experiencia de usuario deficiente y una gestión de red ineficaz. En conclusión, el análisis confirma que el band steering no fue exitoso, y se recomienda una revisión de la configuración de la red para mejorar la gestión de las bandas.",
    "fragments": []
}