{
    "analysis_id": "987671a5-9a0f-4c83-8f75-a53d7bbe78cd",
    "filename": "4042e301-f901-40aa-ac5f-57b0dc8dcf02_MOTO G7 .pcapng",
    "analysis_timestamp": "2026-01-22T15:30:22.144006",
    "total_packets": 20,
    "wlan_packets": 20,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "12:27:9e:88:3a:96",
            "oui": "12:27:9e",
            "vendor": "Moto",
            "device_model": "MOTO G7",
            "device_category": "mobile_device",
            "is_virtual": true,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 2,
    "btm_responses": 0,
    "btm_success_rate": 0.0,
    "successful_transitions": 0,
    "failed_transitions": 1,
    "loops_detected": true,
    "kvr_support": {
        "k_support": false,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.3333333333333333
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe demostrar soporte activo de BSS Transition Management",
            "category": "btm",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Requests: 2, Responses: 0",
            "recommendation": "El cliente ignora las solicitudes BTM. Se recomienda revisar su política de roaming."
        },
        {
            "check_name": "Asociación y Reasociación",
            "description": "Verifica ciclos completos de asociación y reasociación",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 0.5,
            "details": "Assoc: 1/1, Reassoc: 3/4",
            "recommendation": "El dispositivo se asocia pero no demuestra cooperación con protocolos inteligentes (BTM)."
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Cambios de banda: 0",
            "recommendation": "Ajustar umbrales de RSSI para forzar steering"
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": false,
            "severity": "medium",
            "score": 0.3333333333333333,
            "details": "k=False, v=True, r=False",
            "recommendation": "Se recomienda habilitar el estándar faltante para roaming óptimo"
        }
    ],
    "overall_compliance_score": 0.20833333333333331,
    "verdict": "FAILED",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela un veredicto preliminar de **FAILED_LOOP**, lo que indica que no hubo transiciones exitosas y se detectaron bucles en las conexiones. En total, se registraron 2 intentos de steering, pero ninguno resultó en una transición exitosa. La única transición fallida se produjo en un intento de cambio de banda de 2.4GHz a 5GHz, que terminó en un timeout. Además, se observó un comportamiento de loop en el cliente que intentó conectarse repetidamente al mismo BSSID en 5GHz, lo que confirma la falta de gestión efectiva del band steering. La calidad de la captura es válida, pero el resultado es negativo debido a la ausencia de eventos BTM y la incapacidad de realizar transiciones exitosas.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\nEn la captura no se detectaron eventos de BTM (BSS Transition Management), lo que indica que no se utilizó el protocolo 802.11v para gestionar el steering. Se registraron 0 eventos BTM, lo que significa que no hubo solicitudes ni respuestas, y por lo tanto, no se logró un estado de aceptación (Status Code 0). En cuanto a los estándares 802.11k, 802.11v y 802.11r, se observó que el soporte para 802.11k y 802.11r fue nulo, mientras que 802.11v fue detectado pero no utilizado efectivamente. Esto sugiere que el cliente no está aprovechando las capacidades de roaming inteligente, lo que contribuye al fallo en el steering.\n\n### 3. DETALLE DE TRANSICIONES\nSe registraron dos intentos de transición:\n1. **Transición 1:** Un intento agresivo de deautenticación que resultó en un loop, donde el cliente permaneció en la misma banda (5GHz) sin cambiar de BSSID. Este intento tuvo un tiempo de 78.459s, lo que indica una ineficiencia significativa en el proceso de conexión.\n2. **Transición 2:** Un intento asistido que buscaba cambiar de 2.4GHz a 5GHz, pero terminó en un timeout después de 50.907s. Este intento fallido también refuerza la falta de efectividad en el steering, ya que no se logró realizar el cambio de banda.\n\nEn resumen, la calidad del band steering en esta red es deficiente, evidenciada por la falta de transiciones exitosas, la presencia de bucles y la ausencia de gestión activa a través de BTM.",
    "fragments": []
}