{
    "analysis_id": "245b76e2-49f7-480e-96d6-7c348606c9b0",
    "filename": "2cb06380-efab-44ae-9c7f-66798bb3a269_MOTO G31 .pcapng",
    "analysis_timestamp": "2026-01-23T07:32:14.097218",
    "total_packets": 15,
    "wlan_packets": 15,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "f8:79:28:86:f3:d4",
            "oui": "f8:79:28",
            "vendor": "Moto",
            "device_model": "MOTO G31",
            "device_category": "mobile_device",
            "is_virtual": false,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 1,
    "btm_responses": 0,
    "btm_success_rate": 0.0,
    "successful_transitions": 0,
    "failed_transitions": 0,
    "loops_detected": false,
    "kvr_support": {
        "k_support": false,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.3333333333333333
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe demostrar soporte activo de BSS Transition Management",
            "category": "btm",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Request: 1, Response: 0",
            "recommendation": "El cliente ignora o rechaza solicitudes BTM. Revisar códigos de estado."
        },
        {
            "check_name": "Asociación y Reasociación",
            "description": "Verifica ciclos completos de asociación y reasociación",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 0.5,
            "details": "Assoc: 0/0, Reassoc: 3/4\nDisassoc: 0, Deauth: 1",
            "recommendation": "El dispositivo se asocia pero no demuestra cooperación con protocolos inteligentes (BTM)."
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Cambios de banda: 0",
            "recommendation": "Ajustar umbrales de RSSI para forzar steering"
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": false,
            "severity": "medium",
            "score": 0.3333333333333333,
            "details": "k=False, v=True, r=False",
            "recommendation": "Se recomienda habilitar el estándar faltante para roaming óptimo"
        }
    ],
    "overall_compliance_score": 0.20833333333333331,
    "verdict": "FAILED",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela que no se logró ninguna transición exitosa entre bandas, lo que se traduce en un veredicto de **FALLIDO**. A pesar de que se detectó un intento de BTM (1 Request), no hubo respuestas del cliente, lo que indica que el cliente probablemente no soporta el estándar 802.11v. No se registraron transiciones exitosas ni fallidas, y el tiempo promedio de transición es de 0 segundos, lo que refuerza la falta de actividad en el steering. Además, no se detectaron bucles, lo que es un aspecto positivo, pero no compensa la falta de funcionalidad en el steering.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\nSe identificó el soporte para el estándar 802.11v, pero el intercambio de BTM fue deficiente. Se registró un BTM Request enviado desde el AP al cliente, pero no hubo ninguna respuesta del cliente, lo que sugiere que el cliente no está configurado para manejar BTM o no es compatible con el protocolo. Esto se traduce en un fallo en la gestión de la transición de bandas. No se detectaron los estándares 802.11k y 802.11r, lo que limita aún más las capacidades de roaming inteligente del cliente.\n\n### 3. DETALLE DE TRANSICIONES\nNo se registraron transiciones exitosas, y el tiempo promedio y máximo de transición es de 0 segundos, lo que indica que no hubo intentos de cambio de banda exitosos. La falta de transiciones exitosas y la ausencia de respuestas a las solicitudes de BTM sugieren que el cliente no está optimizando su conexión a la red, lo que resulta en un rendimiento subóptimo en términos de band steering. \n\nEn conclusión, el análisis confirma el veredicto preliminar de **FALLIDO** en la implementación de band steering, debido a la falta de soporte del cliente para el protocolo BTM y la ausencia de transiciones exitosas.",
    "fragments": []
}