{
    "analysis_id": "d7bd5704-a7a2-462c-b3a1-f21af362a86b",
    "filename": "81d4f574-a775-4582-802e-7cbf63933642_MOTO Z2 Bandsteering .pcapng",
    "analysis_timestamp": "2026-01-22T14:27:14.639416",
    "total_packets": 29,
    "wlan_packets": 29,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "80:58:f8:d8:3a:25",
            "oui": "80:58:f8",
            "vendor": "Moto",
            "device_model": "MOTO Z2 Bandsteering",
            "device_category": "mobile_device",
            "is_virtual": false,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 12,
    "btm_responses": 2,
    "btm_success_rate": 0.08333333333333333,
    "successful_transitions": 1,
    "failed_transitions": 9,
    "loops_detected": true,
    "kvr_support": {
        "k_support": false,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.3333333333333333
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe demostrar soporte activo de BSS Transition Management",
            "category": "btm",
            "passed": true,
            "severity": "high",
            "score": 1.0,
            "details": "Requests: 12, Responses: 2 | Code 0 (Accept)",
            "recommendation": "Habilitar 802.11v"
        },
        {
            "check_name": "Asociación y Reasociación",
            "description": "Verifica ciclos completos de asociación y reasociación",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 1.0,
            "details": "Assoc: 0/0, Reassoc: 6/2",
            "recommendation": null
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": true,
            "severity": "high",
            "score": 1.0,
            "details": "Cambios de banda: 1",
            "recommendation": null
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": false,
            "severity": "medium",
            "score": 0.3333333333333333,
            "details": "k=False, v=True, r=False",
            "recommendation": "Se recomienda habilitar el estándar faltante para roaming óptimo"
        }
    ],
    "overall_compliance_score": 0.8333333333333334,
    "verdict": "SUCCESS",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela que, aunque se detectaron intentos de band steering, la calidad de la transición fue deficiente. Se registraron 12 intentos de steering, de los cuales solo 1 fue exitoso, lo que indica que el cliente tuvo dificultades para cambiar de banda. Además, se observaron bucles en las transiciones, lo que sugiere problemas en la gestión de la red. Sin embargo, se identificó un BTM Accept (Status Code 0) en las respuestas, lo que indica que el cliente cooperó con el AP en el proceso de steering. A pesar de esto, la presencia de múltiples transiciones fallidas y bucles confirma que la experiencia del cliente fue problemática.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\nSe detectó el soporte para el estándar 802.11v, lo que permitió la gestión de BTM. Se registraron 2 BTM Requests y 2 BTM Responses, con un Status Code 0 (Accept), lo que indica que el cliente respondió positivamente a las solicitudes de gestión de la red. Sin embargo, el cliente no mostró un comportamiento de roaming inteligente, ya que las transiciones exitosas fueron escasas y acompañadas de bucles. No se detectaron protocolos 802.11k ni 802.11r, lo que limita la capacidad de roaming avanzado.\n\n### 3. DETALLE DE TRANSICIONES\nLas transiciones observadas fueron problemáticas, con un tiempo promedio de transición de 168.038 segundos y un tiempo máximo de 189.571 segundos. La única transición exitosa fue de 2.4GHz a 5GHz, pero se vio afectada por un bucle, lo que indica que el cliente no pudo mantener la conexión en la banda de 5GHz. Las transiciones fallidas y los bucles sugieren que el steering no fue efectivo, y el cliente experimentó dificultades para estabilizarse en la banda óptima.\n\nEn conclusión, aunque se logró una transición exitosa, la calidad del band steering fue **ACCEPTABLE** debido a los múltiples intentos fallidos y la presencia de bucles, lo que indica que el cliente tuvo que luchar para lograr la transición.",
    "fragments": []
}