{
    "analysis_id": "f8a83d3e-b674-4b95-af8c-6c707a392fcf",
    "filename": "df765271-6880-4670-95b9-098e1c656b9c_MOTO Z2 Bandsteering .pcapng",
    "analysis_timestamp": "2026-01-23T07:41:34.987259",
    "total_packets": 29,
    "wlan_packets": 29,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "80:58:f8:d8:3a:25",
            "oui": "80:58:f8",
            "vendor": "Moto",
            "device_model": "MOTO Z2 Bandsteering",
            "device_category": "mobile_device",
            "is_virtual": false,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 12,
    "btm_responses": 2,
    "btm_success_rate": 0.08333333333333333,
    "successful_transitions": 1,
    "failed_transitions": 9,
    "loops_detected": true,
    "kvr_support": {
        "k_support": false,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.3333333333333333
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe demostrar soporte activo de BSS Transition Management",
            "category": "btm",
            "passed": true,
            "severity": "high",
            "score": 1.0,
            "details": "Requests: 12, Responses: 2\nCode: 0 (Accept)",
            "recommendation": "Habilitar 802.11v"
        },
        {
            "check_name": "Asociación y Reasociación",
            "description": "Verifica ciclos completos de asociación y reasociación",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 1.0,
            "details": "Assoc: 0/0, Reassoc: 6/2\nDisassoc: 3, Deauth: 5",
            "recommendation": null
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": true,
            "severity": "high",
            "score": 1.0,
            "details": "Cambios de banda: 1",
            "recommendation": null
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": false,
            "severity": "medium",
            "score": 0.3333333333333333,
            "details": "k=False, v=True, r=False",
            "recommendation": "Se recomienda habilitar el estándar faltante para roaming óptimo"
        }
    ],
    "overall_compliance_score": 0.8333333333333334,
    "verdict": "SUCCESS",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela que, aunque se registraron múltiples intentos de band steering, solo se logró una transición exitosa. Sin embargo, esta transición se vio acompañada de bucles entre las bandas, lo que indica problemas en la gestión del steering. A pesar de que se detectaron BTM Requests y Responses, con un Status Code 0 (Accept), lo que sugiere que el cliente cooperó con el AP, la presencia de múltiples transiciones fallidas y bucles confirma que la calidad del band steering es **ACEPTABLE**. El tiempo promedio de transición de 168.038 segundos es considerablemente alto, lo que también afecta la experiencia del usuario.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\nSe detectó el soporte para el estándar 802.11v, lo que indica que el cliente es capaz de gestionar el BTM. Se registraron 2 BTM Requests y 2 BTM Responses, con un Status Code 0 (Accept), lo que confirma que el cliente está cooperando con el AP para el steering. Sin embargo, la falta de soporte para 802.11k y 802.11r limita la efectividad del roaming, lo que se traduce en un comportamiento menos eficiente en la transición entre bandas. Esto sugiere que, aunque el cliente tiene capacidades de roaming, no está utilizando todas las herramientas disponibles para optimizar su conexión.\n\n### 3. DETALLE DE TRANSICIONES\nSe registraron un total de 12 intentos de steering, de los cuales solo 1 fue exitoso. Las transiciones exitosas se realizaron entre 2.4GHz y 5GHz, pero todas las transiciones se vieron afectadas por bucles, lo que indica que el cliente no pudo estabilizarse en la banda óptima. El tiempo promedio de transición de 168.038 segundos es excesivo y refleja la ineficiencia del proceso de steering. Además, se observaron 9 transiciones fallidas, incluyendo estados de TIMEOUT y NO_REASSOC, lo que indica problemas significativos en la gestión de la conexión del cliente.\n\nEn resumen, aunque se logró una transición exitosa, la presencia de bucles y un alto número de intentos fallidos sugiere que el band steering no está funcionando de manera óptima, resultando en un veredicto de **ACEPTABLE**.",
    "fragments": []
}