{
    "analysis_id": "c5b8d237-dd07-4575-83b7-4849f9e71507",
    "filename": "71ca9da4-2c87-419a-899d-2ff6cabdc3e3_9.MOTO G52.pcapng",
    "analysis_timestamp": "2026-01-22T13:22:49.894929",
    "total_packets": 199162,
    "wlan_packets": 199162,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "f4:2d:06:43:49:3f",
            "oui": "f4:2d:06",
            "vendor": "Moto",
            "device_model": "MOTO G52",
            "device_category": "mobile_device",
            "is_virtual": false,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 1,
    "btm_responses": 1,
    "btm_success_rate": 1.0,
    "successful_transitions": 1,
    "failed_transitions": 0,
    "loops_detected": false,
    "kvr_support": {
        "k_support": true,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.6666666666666666
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe soportar BSS Transition Management",
            "category": "btm",
            "passed": true,
            "severity": "high",
            "score": 1.0,
            "details": "Requests: 1, Responses: 1",
            "recommendation": null
        },
        {
            "check_name": "Asociación Exitosa",
            "description": "No deben existir fallos de asociación (Status != 0)",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 1.0,
            "details": "Fallos detectados: 0",
            "recommendation": null
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": true,
            "severity": "high",
            "score": 1.0,
            "details": "Cambios de banda: 1",
            "recommendation": null
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": true,
            "severity": "medium",
            "score": 0.6666666666666666,
            "details": "k=True, v=True, r=False",
            "recommendation": null
        }
    ],
    "overall_compliance_score": 0.9166666666666666,
    "verdict": "SUCCESS",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nSe ha confirmado un intercambio BTM (802.11v) exitoso con un Status Code 0 (Accept), lo que indica una transición efectiva y limpia del cliente hacia la banda de 5GHz. Este resultado es un claro indicador de que el cliente soporta y obedece la gestión avanzada de red, cumpliendo con los criterios de evaluación más altos. Además, se detectó una transición exitosa sin intentos fallidos ni bucles, lo que refuerza la calidad del band steering. El tiempo promedio y máximo de transición fue de 0 segundos, lo que sugiere una respuesta inmediata del cliente al cambio de banda. En resumen, el band steering ha sido altamente efectivo y se ha logrado una preferencia clara por la banda óptima.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\nSe detectaron los siguientes protocolos de roaming:\n- **802.11k**: Se registraron Neighbor Reports, lo que permite al cliente conocer las redes disponibles y tomar decisiones informadas sobre el cambio de banda.\n- **802.11v**: Se realizó un intercambio BTM exitoso, con 1 BTM Request enviado desde el AP al cliente y 1 BTM Response recibido del cliente al AP, confirmando su cooperación. El Status Code 0 (Accept) indica que el cliente aceptó la sugerencia de cambio de banda.\n\nLa evidencia sugiere que el cliente es inteligente en su comportamiento de roaming, utilizando los estándares 802.11k y 802.11v para optimizar su conexión.\n\n### 3. DETALLE DE TRANSICIONES\nSe registró un intento de steering que resultó en una transición exitosa. No se reportaron transiciones fallidas ni bucles, lo que indica un rendimiento óptimo del sistema de band steering. La calidad de la transición fue inmediata, con un tiempo promedio y máximo de 0 segundos, lo que demuestra una respuesta rápida y efectiva del cliente al cambio de banda. La ausencia de retransmisiones TCP, reintentos WLAN y errores DNS refuerza la estabilidad de la conexión durante el proceso de transición. \n\nEn conclusión, el análisis confirma que el band steering ha sido implementado de manera efectiva, logrando una transición exitosa y sin inconvenientes, lo que se traduce en una experiencia de usuario óptima.",
    "fragments": []
}