{
    "analysis_id": "09dec849-bec7-4ca3-aad1-2b07d27359b1",
    "filename": "ce18ceaf-ec6e-444a-ba95-1ed6ffea1fef_MOTO G8.pcapng",
    "analysis_timestamp": "2026-01-22T15:48:54.429175",
    "total_packets": 18,
    "wlan_packets": 18,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "24:46:c8:4d:1d:a6",
            "oui": "24:46:c8",
            "vendor": "Moto",
            "device_model": "MOTO G8",
            "device_category": "mobile_device",
            "is_virtual": false,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 2,
    "btm_responses": 0,
    "btm_success_rate": 0.0,
    "successful_transitions": 0,
    "failed_transitions": 1,
    "loops_detected": false,
    "kvr_support": {
        "k_support": false,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.3333333333333333
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe demostrar soporte activo de BSS Transition Management",
            "category": "btm",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Requests: 2, Responses: 0",
            "recommendation": "El cliente ignora o rechaza solicitudes BTM. Revisar códigos de estado."
        },
        {
            "check_name": "Asociación y Reasociación",
            "description": "Verifica ciclos completos de asociación y reasociación",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 0.5,
            "details": "Assoc: 0/0, Reassoc: 3/3\nDisassoc: 0, Deauth: 2",
            "recommendation": "El dispositivo se asocia pero no demuestra cooperación con protocolos inteligentes (BTM)."
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Cambios de banda: 0",
            "recommendation": "Ajustar umbrales de RSSI para forzar steering"
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": false,
            "severity": "medium",
            "score": 0.3333333333333333,
            "details": "k=False, v=True, r=False",
            "recommendation": "Se recomienda habilitar el estándar faltante para roaming óptimo"
        }
    ],
    "overall_compliance_score": 0.20833333333333331,
    "verdict": "FAILED",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela que no se registraron transiciones exitosas en el proceso de band steering, lo que se alinea con el veredicto preliminar de \"FAILED\". A pesar de que se intentaron dos transiciones, ambas resultaron fallidas, con un intento que terminó en un timeout y otro que no logró la reasociación. No se detectaron eventos de BTM (BSS Transition Management), lo que indica que no hubo gestión activa del steering. La ausencia de transiciones exitosas y el estado de timeout confirman que el band steering no funcionó adecuadamente en esta captura.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\n- **Protocolos Detectados**: No se detectaron eventos de 802.11v, lo que implica que no hubo gestión de transición de BSS. El soporte para 802.11k y 802.11r también fue negativo, ya que no se registraron eventos que indiquen su uso.\n- **Intercambio BTM**: No se observaron solicitudes ni respuestas BTM, lo que refuerza la conclusión de que no hubo gestión activa del steering.\n- **Interpretación**: El cliente no parece ser inteligente en términos de roaming, ya que no se activaron los mecanismos de steering que podrían haber facilitado una transición exitosa a la banda de 5GHz.\n\n### 3. DETALLE DE TRANSICIONES\n- **Transición 1**: Intento de transición de 2.4GHz a 5GHz que resultó en un timeout (153.677s). Esto indica que el cliente no pudo completar la transición a la banda de 5GHz, lo que es un indicativo de un fallo en el proceso de steering.\n- **Transición 2**: Intento de desautenticación en la misma banda (5GHz) que no resultó en una reasociación. Esto sugiere que el cliente no pudo reconectarse adecuadamente, lo que contribuye al veredicto de fallo.\n\nEn resumen, la captura muestra un claro fallo en el band steering, con intentos fallidos y sin evidencia de gestión activa a través de BTM. La falta de transiciones exitosas y el estado de timeout refuerzan la conclusión de que el sistema de steering no está funcionando como se esperaba.",
    "fragments": []
}