{
    "analysis_id": "c4a00306-2db8-440b-92a0-6fa079c31903",
    "filename": "51b1e8c1-03d8-4985-9155-0af237454767_MOTO G8.pcapng",
    "analysis_timestamp": "2026-01-23T07:59:01.040246",
    "total_packets": 18,
    "wlan_packets": 18,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "24:46:c8:4d:1d:a6",
            "oui": "24:46:c8",
            "vendor": "Moto",
            "device_model": "MOTO G8",
            "device_category": "mobile_device",
            "is_virtual": false,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 2,
    "btm_responses": 0,
    "btm_success_rate": 0.0,
    "successful_transitions": 0,
    "failed_transitions": 1,
    "loops_detected": false,
    "kvr_support": {
        "k_support": false,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.3333333333333333
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe demostrar soporte activo de BSS Transition Management",
            "category": "btm",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Request: 2, Response: 0",
            "recommendation": "El cliente ignora o rechaza solicitudes BTM. Revisar códigos de estado."
        },
        {
            "check_name": "Asociación y Reasociación",
            "description": "Verifica ciclos completos de asociación y reasociación",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 0.5,
            "details": "Assoc: 0/0, Reassoc: 3/3\nDisassoc: 0, Deauth: 2",
            "recommendation": "El dispositivo se asocia pero no demuestra cooperación con protocolos inteligentes (BTM)."
        },
        {
            "check_name": "Steering Efectivo",
            "description": "Se deben realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Cambios de banda: 0",
            "recommendation": "Ajustar umbrales de RSSI para forzar steering"
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": false,
            "severity": "medium",
            "score": 0.3333333333333333,
            "details": "k=False, v=True, r=False",
            "recommendation": "Se recomienda habilitar el estándar faltante para roaming óptimo"
        }
    ],
    "overall_compliance_score": 0.20833333333333331,
    "verdict": "FAILED",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela que no se registraron transiciones exitosas en el proceso de band steering, lo que se alinea con el veredicto preliminar de \"FAILED\". No se detectaron eventos de BTM (BSS Transition Management), lo que indica que no hubo gestión activa del steering. Aunque se intentó una transición de 2.4GHz a 5GHz, esta resultó en un timeout, lo que significa que el cliente no logró cambiar de banda. Además, se registró un intento de desconexión (Deauth) sin una reasociación exitosa, lo que refuerza la conclusión de que el steering falló. En resumen, no hubo transiciones exitosas y el cliente no pudo beneficiarse de la banda de 5GHz.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\nEn la captura analizada, no se detectaron protocolos de gestión de transición BTM (802.11v), ya que no hubo solicitudes ni respuestas (0 eventos BTM). Esto indica que el cliente no está utilizando mecanismos avanzados de steering, lo que limita la capacidad de la red para gestionar de manera efectiva las transiciones entre bandas. En cuanto a los estándares 802.11k, 802.11v y 802.11r, se observó que el soporte para 802.11k y 802.11r fue nulo, mientras que 802.11v fue detectado pero sin funcionalidad efectiva. Esto sugiere que el cliente no es \"inteligente\" en términos de roaming, ya que no está aprovechando las capacidades de gestión de red disponibles.\n\n### 3. DETALLE DE TRANSICIONES\nSe registraron dos intentos de transición:\n1. **Transición Asistida (802.11k/v/r)**: Intento de cambiar de 2.4GHz a 5GHz que resultó en un timeout, indicando que el cliente no pudo completar la transición. El tiempo promedio de transición fue de 153.677 segundos, lo que es inusualmente largo y sugiere problemas de conectividad o configuración.\n2. **Transición Agresiva (Deauth)**: Se registró una desconexión (Deauth) en la misma banda (5GHz) sin una reasociación exitosa, lo que indica un fallo en la gestión de la conexión.\n\nEn conclusión, el análisis confirma que el band steering ha fallado, con un score global de 20.83% en el cumplimiento de AIDLC y sin transiciones exitosas. La falta de eventos BTM y el comportamiento del cliente sugieren que no se están utilizando las capacidades avanzadas de gestión de red, lo que limita la efectividad del steering.",
    "fragments": []
}