{
    "analysis_id": "e42c1be0-2f55-415b-9f07-1ba2848e79ca",
    "filename": "464b7992-2be2-44b8-903a-b449ffd421a7_6.SAMSUNG A70.pcapng",
    "analysis_timestamp": "2026-01-22T11:57:01.205761",
    "total_packets": 280460,
    "wlan_packets": 280455,
    "analysis_duration_ms": 0,
    "devices": [
        {
            "mac_address": "a8:2b:b9:d0:85:ee",
            "oui": "a8:2b:b9",
            "vendor": "Samsung",
            "device_model": "SAMSUNG A70",
            "device_category": "mobile_device",
            "is_virtual": false,
            "confidence_score": 1.0
        }
    ],
    "btm_events": [],
    "transitions": [],
    "btm_requests": 2,
    "btm_responses": 2,
    "btm_success_rate": 0.0,
    "successful_transitions": 0,
    "failed_transitions": 0,
    "loops_detected": false,
    "kvr_support": {
        "k_support": true,
        "v_support": true,
        "r_support": false,
        "compliance_score": 0.6666666666666666
    },
    "compliance_checks": [
        {
            "check_name": "Soporte BTM (802.11v)",
            "description": "El dispositivo debe soportar BSS Transition Management",
            "category": "btm",
            "passed": true,
            "severity": "high",
            "score": 1.0,
            "details": "Requests: 2, Responses: 2",
            "recommendation": null
        },
        {
            "check_name": "Asociación Exitosa",
            "description": "No deben existir fallos de asociación (Status != 0)",
            "category": "association",
            "passed": true,
            "severity": "medium",
            "score": 1.0,
            "details": "Fallos detectados: 0",
            "recommendation": null
        },
        {
            "check_name": "Steering Efectivo",
            "description": "El dispositivo debe realizar cambios de banda efectivos (2.4 -> 5GHz)",
            "category": "performance",
            "passed": false,
            "severity": "high",
            "score": 0.0,
            "details": "Cambios de banda: 0",
            "recommendation": "Ajustar umbrales de RSSI para forzar steering"
        },
        {
            "check_name": "Estándares KVR",
            "description": "Soporte de estándares de movilidad (Mínimo 2 de 3: k, v, r)",
            "category": "kvr",
            "passed": true,
            "severity": "medium",
            "score": 0.6666666666666666,
            "details": "k=True, v=True, r=False",
            "recommendation": null
        }
    ],
    "overall_compliance_score": 0.6666666666666666,
    "verdict": "FAILED",
    "analysis_text": "### 1. RESUMEN EJECUTIVO (EVIDENCIA CLAVE)\nEl análisis de la captura de Wireshark revela que, aunque se detectaron intentos de band steering, la calidad de la transición fue deficiente. Se registraron 11 intentos de steering, de los cuales solo 1 fue exitoso, lo que indica que el proceso de transición no fue eficiente. A pesar de que se observó un BTM Accept (Status Code 0) en las respuestas de BTM, la presencia de 8 transiciones fallidas y bucles detectados sugiere que el cliente tuvo dificultades significativas para cambiar de banda. Esto se traduce en un veredicto de ACCEPTABLE, ya que hubo una transición exitosa, pero con múltiples intentos fallidos y problemas de bucle.\n\n### 2. ANÁLISIS BTM Y KVR (802.11k/v/r)\nSe detectaron los siguientes protocolos de roaming:\n- **802.11k:** Se registraron Neighbor Reports, lo que indica que el cliente tiene información sobre las redes disponibles.\n- **802.11v:** Se observaron BTM Requests y Responses, lo que confirma que el cliente está cooperando con la gestión de la red.\n\nEl intercambio de BTM mostró 2 solicitudes y 2 respuestas, con un código de estado 0 (Accept), lo que indica que el cliente aceptó la sugerencia del AP para cambiar de banda. Sin embargo, la efectividad del steering se ve comprometida por los múltiples intentos fallidos y los bucles, lo que sugiere que el cliente no está respondiendo de manera óptima a las recomendaciones de la red.\n\n### 3. DETALLE DE TRANSICIONES\nLas transiciones observadas fueron problemáticas:\n- La única transición exitosa se produjo de 2.4GHz a 5GHz, pero con un tiempo de 119.054 segundos, lo que es excesivo y sugiere que el cliente tuvo dificultades para completar el cambio.\n- Se registraron múltiples intentos de transición fallidos, incluyendo bucles donde el cliente permaneció en la misma banda sin poder reasociarse, lo que indica un comportamiento ineficiente en el proceso de roaming.\n\nEn conclusión, aunque se logró una transición exitosa, la calidad del band steering es deficiente debido a los numerosos intentos fallidos y la presencia de bucles, lo que justifica el veredicto de ACCEPTABLE.",
    "fragments": []
}